numerator = [
["Анализ больших данных лек. 440",
"Автоматизация перегрузочного процесса в портах и транспортных терминала 428",
"Управление ИТ-проектами 361","Численные методы 440"],
["Методы и средства проектирования информационных систем и технологий 428",
"Методы и средства проектирования информационных систем и технологий лек. 530",
"Информационно-коммуникационные системы и сети лек. 530"],
["Анализ больших данных лек. 528",
"Анализ больих данных 170",
"Информационно-коммуникационные системы и сети 385"],
["Автоматизация перегрузочного процесса в портах и транспортных лек. 440",
"Управление ИТ проектами лек. 370",
"Социлогия и политология 301"]]

denominator = [
["Численные методы лек. 440",
"Анализ больших данных 385",
"Управление ИТ-проектами 361",
"Численные методы 440"],
["Методы и средства проектирования информационных систем и технологий 428",
"Методы и средства проектирования информационных систем и технологий лек. 530",
"Информационно-коммуникационные системы и сети лек. 530"],
["Анализ больших данных лек. 528",
"Анализ больих данных 170",
"Информационно-коммуникационные системы и сети 385"],
["Автоматизация перегрузочного процесса в портах и транспортных лек. 440",
"Управление ИТ проектами лек. 370",
"Социлогия и политология лек. 301"]]