# Commands:
# '/start'
on_start_command = "Привет! 👋\nКликнув на кнопку ниже, ты сможешь просмотреть расписание для своей группы!"

# Data base:
db_user_data_not_found = "Хм, похоже тебя нет в базе. Диктуй, я записываю.."

# State machine:
sm_welcome_message = "Пройди, пожалуйста, коротенький опрос. Указанные данные помогут тебе быстрее получать расписание."
sm_user_group_code = "В какой группе ты учишься? ИС-31, или, быть может, ГМУ-12?"
sm_user_subgroup_code = "А в какой подгруппе: первой или второй?"
sm_user_group_leader = "Предпоследний вопрос: ты староста группы?"
sm_everything_is_correct = "Проверь, пожалуйста, всё ли правильно мы записали?"
sm_we_got_it = "Отлично! Мы всё получили."
